tests/BusinessLogic/Common/MockObjects/SeQuraOrder.json

{
  "order": {
    "merchant": {
      "id":"logeecom",
      "notify_url":"https://wix.sequra.test/api/webhooks",
      "notification_parameters": {
        "signature": "K6hDNSwfcJjF+suAJqXAjA==",
        "test1": "test"
      },
      "return_url":"https://cashier-services.wix.com/_api/payment-services-web/plugin/redirections/ba1a2231-ff21-43db-af2a-6c63703f5781/approved",
      "approved_callback":"",
      "edit_url":"",
      "abort_url":"https://cashier-services.wix.com/_api/payment-services-web/plugin/redirections/ba1a2231-ff21-43db-af2a-6c63703f5781/canceled",
      "rejected_callback":"",
      "partpayment_details_getter":"",
      "approved_url":"",
      "options":{
        "has_jquery": false
      },
      "events_webhook":{
        "url":"https://wix.sequra.test/api/webhooks"
      }
    },
    "merchant_reference": {
      "order_ref_1": "ZXCV1234",
      "order_ref_2": "0080-1234-4343-5353"
    },
    "shipped_cart": {
      "currency": "EUR",
      "order_total_with_tax": 0,
      "items": []
    },
    "unshipped_cart": {
      "currency": "EUR",
      "order_total_with_tax": 6097,
      "items": [
        {
          "type":"product",
          "total_with_tax":170000,
          "reference":"9ca7d219-60ae-c8b6-15ae-8eb54be7ba44",
          "name":"Polvo de perla",
          "price_with_tax":170000,
          "quantity":1,
          "downloadable":false
        },
        {
          "type": "handling",
          "reference": "seur24",
          "name": "SEUR entrega en 24 horas",
          "total_with_tax": 242
        },
        {
          "type": "invoice_fee",
          "total_with_tax": 295
        },
        {
          "type": "discount",
          "reference": "HALFOFF",
          "name": "50 % off the full basket!",
          "total_with_tax": -750
        },
        {
          "type": "other_payment",
          "reference": "CASH",
          "name": "Paid in cash",
          "total_with_tax": -750
        }
      ]
    },
    "delivery_method": {
      "name": "SEUR24",
      "days": "¡Entrega día siguiente!",
      "provider": "Correos",
      "home_delivery": true
    },
    "delivery_address": {
      "given_names": "Maria José",
      "surnames": "Barroso Rajoy",
      "company": "",
      "address_line_1": "C/ Aragó 383",
      "address_line_2": "5º",
      "postal_code": "08013",
      "city": "Barcelona",
      "country_code": "ES",
      "phone": "933 033 033",
      "mobile_phone": "615 615 615",
      "state": "Barcelona",
      "extra": "I'm home between 9 and 12.",
      "vat_number": "B12345"
    },
    "invoice_address": {
      "given_names": "Maria José",
      "surnames": "Barroso Rajoy",
      "company": "",
      "address_line_1": "",
      "address_line_2": "",
      "postal_code": "",
      "city": "",
      "country_code": "ES",
      "phone": "933 033 033",
      "mobile_phone": "615 615 615",
      "state": "Tarragona",
      "extra": "I'm home between 9 and 12.",
      "vat_number": "B12345"
    },
    "customer": {
      "given_names": "Maria José",
      "surnames": "Barroso Rajoy",
      "title": "mr",
      "email": "nisse@example.com",
      "ref": 123,
      "date_of_birth": "1980-01-20",
      "nin": "13003009L",
      "company": "",
      "vat_number": "B12345",
      "rating": 100,
      "nin_control": "15012018F2"
    },
    "platform": {
      "name": "Navision/www.theshop.es",
      "version": "1.1",
      "plugin_version": "1.0.2",
      "uname": "Darwin roatan.local 13.0.0 Darwin Kernel Version 13.0... x86_64",
      "db_name": "MSSQL",
      "db_version": "1.2.3"
    },
    "gui": {
      "layout": "desktop"
    }
  }
}
